load-test.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: http://10.0.0.207:8081
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 20
      name: Warm up phase
    - duration: 60
      arrivalRate: 10
      rampTo: 30
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 50
      name: Spike phase
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75
scenarios:
  - flow:
      - loop:
          - get:
              url: "/todo"
          # - post:
          #     url: "/todo/add"
          #     form:
          #       newItem: "test"
        count: 100